package org.easypr;

/**
 * 车牌前两位转所在地工具类
 * 
 * @author mly
 *
 */
public class BriefCityUtil {
	public static String allLoaction="";
	// public static void main(String[] args) {
	// SubStringSecond("苏DAS589"); 苏DAS589|苏DAS669|苏DA6666
//		String str = "苏DAS589-苏DAS669-苏DA6666";
//	      String[] temp;
//	      String delimeter = "-";  // 指定分割字符
//	      temp = str.split(delimeter); // 分割字符串 
//	      // 普通 for 循环
//	      for(int i =0; i < temp.length ; i++){
//	         System.out.println(temp[i]);
//	         System.out.println("");
//	      }
//	 
//	      System.out.println("------java for each循环输出的方法-----");
//	      String str1 = "www.runoob.com";
//	      String[] temp1;
//	      String delimeter1 = "\\.";  // 指定分割字符， . 号需要转义
//	      temp1 = str1.split(delimeter1); // 分割字符串
//	      for(String x :  temp1){
//	         System.out.println(x);
//	         System.out.println("");
//	      }
	// TotalPlate("苏DAS5d89-苏AAS669-冀TA6666-");
	// Ge("晋EAS589|苏D12345|");
	// }
	/**
	 * 
	 * @param two 车牌号码
	 * @return
	 */
	public static String SubStringSecond(String two) {
		try {
			String carlocation = two.substring(0, 2);
			Plate(carlocation);
		} catch (Exception e) {
			System.out.println("车牌无法识别，因此找不到车牌前两位");
		}
		
		return two;

	}

	/**
	 * 
	 * @param totalplate 
	 */
	public static String TotalPlate(String totalplate) {
		String[] temp;
		String delimeter = "-"; // 指定分割字符
		temp = totalplate.split(delimeter); // 分割字符串
		for (int i = 0; i < temp.length; i++) {
			System.out.println(temp[i]);// 分割后的车牌号
			SubStringSecond(temp[i]);
			System.out.println("");
		}
		return totalplate;
	}
	//车牌号前两位与其所在地一一对应
	public static String Plate(String plate) {
		String briefcity[] = { "冀A", "冀B", "冀C", "冀D", "冀E", "冀F", "冀G", "冀H", "冀J", "冀R", "冀T", "豫A", "豫B", "豫C", "豫D",
				"豫E", "豫F", "豫G", "豫H", "豫J", "豫K", "豫L", "豫M", "豫N", "豫P", "豫Q", "豫R", "豫S", "豫U", "琼A", "琼B", "琼C",
				"琼D", "琼E", "琼F", "桂A", "桂B", "桂C", "桂D", "桂E", "桂F", "桂G", "桂H", "桂J", "桂K", "桂L", "桂M", "桂N", "桂P",
				"桂R", "皖A", "皖B", "皖C", "皖D", "皖E", "皖F", "皖G", "皖H", "皖J", "皖K", "皖L", "皖M", "皖N", "皖P", "皖R", "皖S",
				"陕A", "陕B", "陕C", "陕D", "陕E", "陕F", "陕G", "陕H", "陕J", "陕K", "陕V", "辽A", "辽B", "辽C", "辽D", "辽E", "辽F",
				"辽G", "辽H", "辽J", "辽K", "辽AL", "辽M", "辽N", "辽P", "晋A", "晋B", "晋C", "晋D", "晋E", "晋F", "晋H", "晋J", "晋K",
				"晋L", "晋M", "渝A", "渝B", "渝C", "渝D", "渝F", "渝G", "渝H", "粤A", "粤B", "粤C", "粤D", "粤E", "粤F", "粤G", "粤H",
				"粤J", "粤K", "粤L", "粤M", "粤N", "粤P", "粤Q", "粤R", "粤S", "粤T", "粤U", "粤V", "粤W", "粤X", "粤Y", "粤Z", "宁A",
				"宁B", "宁C", "宁D", "宁E", "京A", "京B", "京C", "京D", "京E", "京F", "京G", "京H", "京J", "京K", "京L", "京M", "京N",
				"京P", "京Q", "京Y", "黑A", "黑B", "黑C", "黑D", "黑E", "黑F", "黑G", "黑H", "黑J", "黑K", "黑L", "黑M", "黑N", "黑P",
				"黑R", "云A", "云C", "云D", "云E", "云F", "云G", "云H", "云J", "云K", "云L", "云M", "云N", "云P", "云Q", "云R", "云S",
				"蒙A", "蒙B", "蒙C", "蒙D", "蒙E", "蒙F", "蒙G", "蒙H", "蒙J", "蒙K", "蒙L", "蒙M", "苏A", "苏B", "苏C", "苏D", "苏E",
				"苏F", "苏G", "苏H", "苏J", "苏K", "苏L", "苏M", "苏N", "苏U", "浙A", "浙B", "浙C", "浙D", "浙E", "浙F", "浙G", "浙H",
				"浙J", "浙K", "浙L", "吉A", "吉B", "吉C", "吉D", "吉E", "吉F", "吉G", "吉H", "吉J", "吉K", "川A", "川B", "川C", "川D",
				"川E", "川F", "川G", "川H", "川J", "川K", "川L", "川M", "川Q", "川R", "川S", "川T", "川U", "川V", "川W", "川X", "川Y",
				"川Z", "青A", "青B", "青C", "青D", "青E", "青F", "青G", "青H", "津A", "津B", "津C", "津D", "津E", "津F", "津G", "津H",
				"津J", "津K", "津L", "津M", "津N", "津Q", "津R", "鄂A", "鄂B", "鄂C", "鄂D", "鄂E", "鄂F", "鄂G", "鄂H", "鄂J", "鄂K",
				"鄂L", "鄂M", "鄂N", "鄂P", "鄂Q", "鄂R", "鄂S", "湘A", "湘B", "湘C", "湘D", "湘E", "湘F", "湘G", "湘H", "湘J", "湘K",
				"湘L", "湘M", "湘N", "湘U", "湘S", "新A", "新B", "新C", "新D", "新E", "新F", "新G", "新H", "新J", "新K", "新L", "新M",
				"新N", "新P", "新Q", "新R", "赣A", "赣B", "赣C", "赣D", "赣E", "赣F", "赣G", "赣H", "赣J", "赣K", "赣L", "赣M", "甘A",
				"甘B", "甘C", "甘D", "甘E", "甘F", "甘G", "甘H", "甘J", "甘K", "甘L", "甘M", "甘N", "甘P", "闽A", "闽B", "闽C", "闽D",
				"闽E", "闽F", "闽G", "闽H", "闽J", "闽K", "贵A", "贵B", "贵C", "贵D", "贵E", "贵F", "贵G", "贵H", "贵J", "鲁A", "鲁B",
				"鲁C", "鲁D", "鲁E", "鲁F", "鲁G", "鲁H", "鲁J", "鲁K", "鲁L", "鲁M", "鲁N", "鲁P", "鲁Q", "鲁R", "鲁S", "鲁U", "鲁V",
				"鲁W", "鲁Y", "藏A", "藏B", "藏C", "藏D", "藏E", "藏F", "藏G", "藏H", "藏J", "沪A", "沪B", "沪C", "沪D", "沪E", "沪F",
				"沪G", "沪H", "沪J", "沪K", "沪L", "沪M", "沪N", "沪R" };
		String location[] = { "河北省石家庄", "河北省唐山市", "河北省秦皇岛市", "河北省邯郸市", "河北省邢台市", "河北省保定市", "河北省张家口市", "河北省承德市",
				"河北省沧州市", "河北省廊坊市", "河北省衡水市", "河南省郑州市", "河南省开封市", "河南省洛阳市", "河南省平顶山市", "河南省安阳市", "河南省鹤壁市", "河南省新乡市",
				"河南省焦作市", "河南省濮阳市", "河南省许昌市", "河南省漯河市", "河南省三门峡市", "河南省商丘市", "河南省周口市", "河南省驻马店市", "河南省南阳市", "河南省信阳市",
				"河南省济源市", "海南省海口市", "海南省三亚市", "海南省琼海市等", "海南省五指山市、东方市", "海南省洋浦开发区", "海南省儋州市", "广西壮族自治区南宁市",
				"广西壮族自治区柳州市", "广西壮族自治区桂林市（六区加阳朔）", "广西壮族自治区梧州市", "广西壮族自治区北海市", "广西壮族自治区崇左市", "广西壮族自治区来宾市",
				"广西壮族自治区桂林市下辖县(除阳朔)", "广西壮族自治区贺州市", "广西壮族自治区玉林市", "广西壮族自治区百色市", "广西壮族自治区河池市", "广西壮族自治区钦州市",
				"广西壮族自治区防城港市", "广西壮族自治区贵港市", "安徽省合肥市", "安徽省芜湖市", "安徽省蚌埠市", "安徽省淮南市", "安徽省马鞍山市", "安徽省淮北市", "安徽省铜陵市",
				"安徽省安庆市", "安徽省黄山市", "安徽省阜阳市", "安徽省宿州市", "安徽省滁州市", "安徽省六安市", "安徽省宣城市", "安徽省池州市", "安徽省毫州市", "陕西省西安市",
				"陕西省铜川市", "陕西省宝鸡市", "陕西省咸阳市", "陕西省渭南市", "陕西省汉中市", "陕西省安康市", "陕西省商洛市", "陕西省延安市", "陕西省榆林市", "陕西省杨陵农业示范区",
				"辽宁省沈阳市", "辽宁省大连市", "辽宁省鞍山市", "辽宁省抚顺市", "辽宁省本溪市", "辽宁省丹东市", "辽宁省锦州市", "辽宁省营口市", "辽宁省阜新市", "辽宁省辽阳市",
				"辽宁省盘锦市", "辽宁省铁岭市", "辽宁省朝阳市", "辽宁省葫芦岛市", "山西省太原市", "山西省大同市", "山西省阳泉市", "山西省长治市", "山西省晋城市", "山西省朔州市",
				"山西省忻州市", "山西省吕梁市", "山西省晋中市", "山西省临汾市", "山西省运城市", "重庆市", "重庆市", "重庆市", "重庆市", "重庆市", "重庆市", "重庆市",
				"广东省广州市", "广东省深圳市", "广东省珠海市", "广东省汕头市", "广东省佛山市", "广东省韶关市", "广东省湛江市", "广东省肇庆市", "广东省江门市", "广东省茂名市",
				"广东省惠州市", "广东省梅州市", "广东省汕尾市", "广东省河源市", "广东省阳江市", "广东省清远市", "广东省东菀市", "广东省中山市", "广东省潮州市", "广东省揭阳市",
				"广东省云浮市", "广东省[原佛山市顺德区]", "广东省[原佛山市南海区]", "广东省港澳进入内地车辆", "宁夏回族自治区银川市", "宁夏回族自治区石嘴山市", "宁夏回族自治区吴忠市",
				"宁夏回族自治区固原市", "宁夏回族自治区中卫市", "北京市", "北京市出租汽车", "北京市", "暂未发布", "北京市", "北京市", "北京市郊区县", "北京市", "北京市",
				"北京市", "北京市", "北京市", "北京市", "北京市", "北京市", "北京市郊区县", "黑龙江省哈尔滨市市区(除双城区)", "黑龙江省齐齐哈尔", "黑龙江省牡丹江市",
				"黑龙江省佳木斯市", "黑龙江省大庆市", "黑龙江省伊春市", "黑龙江省鸡西市", "黑龙江省鹤岗市", "黑龙江省双鸭山市", "黑龙江省七台河市", "黑龙江省哈尔滨市下辖县和双城区",
				"黑龙江省绥化市", "黑龙江省黑河市", "黑龙江省大兴安岭地区", "黑龙江省农垦系统", "云南省昆明市", "云南省邵通市", "云南省曲靖市", "云南省楚雄彝族自治州", "云南省玉溪市",
				"云南省红河哈尼族彝族自治州", "云南省文山壮族苗族自治州", "云南省普洱市", "云南省西双版纳傣族自治州", "云南省大理白族自治州", "云南省保山市", "云南省德宏傣族景颇族自治州",
				"云南省丽江市", "云南省怒江傈僳族自治州", "云南省迪庆藏族自治州", "云南省临沧市", "内蒙古自治区呼和浩特市", "内蒙古自治区包头市", "内蒙古自治区乌海市", "内蒙古自治区赤峰市",
				"内蒙古自治区呼伦贝尔市", "内蒙古自治区兴安盟", "内蒙古自治区通辽市", "内蒙古自治区锡林郭勒盟", "内蒙古自治区乌兰察布市", "内蒙古自治区鄂尔多斯市", "内蒙古自治区巴彦淖尔市",
				"内蒙古自治区阿拉善盟", "江苏省南京市", "江苏省无锡市", "江苏省徐州市", "江苏省常州市", "江苏省苏州市", "江苏省南通市", "江苏省连云港市", "江苏省淮安市", "江苏省盐城市",
				"江苏省扬州市", "江苏省镇江市", "江苏省泰州市", "江苏省宿迁市", "江苏省苏州市增补(双号牌)", "浙江省杭州市", "浙江省宁波市", "浙江省温州市", "浙江省绍兴市",
				"浙江省湖州市", "浙江省嘉兴市", "浙江省金华市", "浙江省衢州市", "浙江省台州市", "浙江省丽水市", "浙江省舟山市", "吉林省长春市", "吉林省吉林市", "吉林省四平市",
				"吉林省辽源市", "吉林省通化市", "吉林省白山市", "吉林省白城市", "吉林省延边朝鲜族自治州", "吉林省松原市", "吉林省长白山管委会", "四川省成都市", "四川省绵阳市",
				"四川省自贡市", "四川省攀枝花市", "四川省泸州市", "四川省德阳市", "四川省成都市(增补)", "四川省广元市", "四川省遂宁市", "四川省内江市", "四川省乐山市", "四川省资阳市",
				"四川省宜宾市", "四川省南充市", "四川省达州市", "四川省雅安市", "四川省阿贝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州", "四川省广安市", "四川省巴中市",
				"四川省眉山市", "青海省西宁市", "青海省海东市", "青海省海北藏族自治州", "青海省黄南藏族自治州", "青海省海南藏族自治州", "青海省果洛藏族自治州", "青海省玉树藏族自治州",
				"青海省海西蒙古族自治州", "天津市", "天津市", "天津市", "天津市", "天津市出租汽车", "天津市", "天津市", "天津市", "天津市", "天津市", "天津市", "天津市",
				"天津市", "天津市", "天津市", "湖北省武汉市", "湖北省黄石市", "湖北省十堰市", "湖北省荆州市", "湖北省宜昌市", "湖北省襄阳市", "湖北省鄂州市", "湖北省荆门市",
				"湖北省黄冈市", "湖北省孝感市", "湖北省咸宁市", "湖北省仙桃市", "湖北省潜江市", "湖北省神农架林区", "湖北省恩施土家族苗族自治州", "湖北省天门市", "湖北省随州市",
				"湖南省长沙市", "湖南省株洲市", "湖南省湘潭市", "湖南省邵阳市", "湖南省岳阳市", "湖南省张家界市", "湖南省益阳市", "湖南省常德市", "湖南省娄底市", "湖南省郴州市",
				"湖南省永州市", "湖南省怀化市", "湖南省湘西土家族苗族自治州", "湖南省省直系统", "新疆维吾尔自治区乌鲁木齐", "新疆维吾尔自治区昌吉回族自治州", "新疆维吾尔自治区石河子市",
				"新疆维吾尔自治区奎屯市", "新疆维吾尔自治区博尔塔拉蒙古自治州", "新疆维吾尔自治区伊犁哈萨克自治州直辖县市", "新疆维吾尔自治区伊犁哈萨克自治州塔城地区", "新疆伊犁哈萨克自治州阿勒泰地区",
				"新疆克拉玛依市", "新疆吐鲁番地区", "新疆哈密地区", "新疆巴音郭楞蒙古自治州", "新疆阿克苏地区", "新疆克孜勒苏柯尔克孜自治州", "新疆喀什地区", "新疆和田地区", "江西省南昌市",
				"江西省赣州市", "江西省宜春市", "江西省吉安市", "江西省上饶市", "江西省抚州市", "江西省九江市", "江西省景德镇市", "江西省萍乡市", "江西省新余市", "江西省鹰潭市",
				"江西省省直系统", "甘肃省兰州市", "甘肃省嘉峪关市", "甘肃省金昌市", "甘肃省白银市", "甘肃省天水市", "甘肃省酒泉市", "甘肃省张掖市", "甘肃省武威市", "甘肃省定西市",
				"甘肃省陇南市", "甘肃省平凉市", "甘肃省庆阳市", "甘肃省临夏回族自治州", "甘肃省甘南藏族自治州", "福建省福州市", "福建省莆田市", "福建省泉州市", "福建省厦门市",
				"福建省漳州市", "福建省龙岩市", "福建省三明市", "福建省南平市", "福建省宁德市", "福建省平潭综合实验区", "贵州省贵阳市", "贵州省六盘水市", "贵州省遵义市", "贵州省铜仁市",
				"贵州省黔西南布依族苗族自治州", "贵州省毕节市", "贵州省安顺市", "贵州省黔东南苗族侗族自治州", "贵州省黔南布依族苗族自治州", "山东济南市（除莱芜区、钢城区）", "山东省青岛市",
				"山东省淄博市", "山东省枣庄市", "山东省东营市", "山东省烟台市", "山东省潍坊市", "山东省济宁市", "山东省泰安市", "山东省威海市", "山东省日照市", "山东省滨州市",
				"山东省德州市", "山东省聊城市", "山东省临沂市", "山东省菏泽市", "山东济南市莱芜区、钢城区", "山东省青岛市增补", "山东潍坊市增补", "山东省省直系统", "山东省烟台市增补",
				"西藏自治区拉萨市", "西藏自治区昌都市", "西藏自治区山南市", "西藏自治区日喀则市", "西藏自治区那曲市", "西藏自治区阿里地区", "西藏自治区林芝市",
				"西藏自治区驻四川省天全县车辆管理所", "驻青海省格尔木市车辆管理所", "上海市", "上海市", "上海市(郊区牌照，不能进入以S20环线以内)", "上海市", "上海市", "上海市",
				"上海市", "上海市", "上海市", "上海市", "上海市", "上海市", "上海市", "[原崇明、长兴、横沙专用车牌，不能驶出三岛]" };
		int index = 0;
		try {
			for (int i = 0; i < location.length; i++) {
				if (plate.equalsIgnoreCase(briefcity[i])) {
					index = i;
					allLoaction+=location[i]+" ";
					System.out.println("车辆所在地为：" + location[i]);
				}
			}
		} catch (Exception e) {
			e.printStackTrace();
			System.out.println("查询不到车辆所在地");
		}

		return plate;

	}

	

}
